@snehal1219901 Thanks for raising this issue 👏.
With the sample configuration I get an error:

```console
% terraform plan
...
Error: Invalid Configuration for Read-Only Attribute
│ 
│   with awscc_rds_global_cluster.rdsdb,
│   on main.tf line 6, in resource "awscc_rds_global_cluster" "rdsdb":
│    6:   id     = "test"
│ 
│ Cannot set value for this attribute as the provider has marked it as read-only. Remove the configuration line setting the
│ value.
│ 
│ Refer to the provider documentation or contact the provider developers for additional information about configurable and
│ read-only attributes that are supported.
```

The `id` attribute is set by the provider after resource creation and cannot be specified in configuration.
You can use the `global_cluster_identifier` argument to configured a cluster identifier (or omit it if you specify `engine`):

```console
% terraform apply
...
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # awscc_rds_global_cluster.rdsdb will be created
  + resource "awscc_rds_global_cluster" "rdsdb" {
      + engine                       = "aurora"
      + engine_version               = (known after apply)
      + global_cluster_identifier    = (known after apply)
      + id                           = (known after apply)
      + source_db_cluster_identifier = (known after apply)
      + storage_encrypted            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

awscc_rds_global_cluster.rdsdb: Creating...
awscc_rds_global_cluster.rdsdb: Creation complete after 6s [id=tbkimwhnwzzwoies1lpiptof5-svktrzlecokp]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```